app/Controllers/ApiController.php

    public function index()
    {
        $data = [
            'results' => [],
            'status' => ["code" => 401, "description" => "Unauthorized"]
        ];

        $headers = $this->request->headers();

        array_walk($headers, function (&$value, $key) {
            $value = $value->getValue();
        });

        if(array_key_exists("Key", $headers)){
            if ($headers["Key"] == $this->apiKey) {
                $penjualan = $this->transaction->findAll();

                foreach ($penjualan as &$pj) {
                $details = $this->transaction_detail->where('transaction_id', $pj['id'])->findAll();
---
SELECT *
FROM `transaction`
SELECT *
FROM `transaction_detail`
WHERE `transaction_id` = '1'