app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'salwarama'
 LIMIT 1
SELECT *
FROM `diskon`
WHERE `tanggal` = '2025-07-05'
 LIMIT 1
---
    public function login()
{
    if ($this->request->getPost()) {
        $rules = [
            'username' => 'required|min_length[6]',
            'password' => 'required|min_length[7]|numeric',
        ];

        if ($this->validate($rules)) {
            $username = $this->request->getVar('username');
            $password = $this->request->getVar('password');

            $dataUser = $this->user->where(['username' => $username])->first(); //pasw 1234567

            if ($dataUser) {
                if (password_verify($password, $dataUser['password'])) {
                    session()->set([
                        'username' => $dataUser['username'],
                        'role' => $dataUser['role'],
                        'isLoggedIn' => TRUE
                    ]);

<<<<<<< HEAD
// 🔽 Tambahkan bagian ini untuk ambil diskon hari ini
                    $diskonModel = new DiskonModel();
                    $diskonHariIni = $diskonModel->where('tanggal', date('Y-m-d'))->first();