app/Controllers/DiskonController.php

SELECT *
FROM `diskon`
---
    public function index()
    {
        if (session()->get('role') != 'admin') return redirect()->to('/');
        $data['diskon'] = $this->diskonModel->findAll();

SELECT *
FROM `diskon`
WHERE `tanggal` = '2025-07-05'
 LIMIT 1
INSERT INTO `diskon` (`tanggal`, `nominal`, `created_at`, `updated_at`) VALUES ('2025-07-05', '50000', '2025-07-05 12:18:17', '2025-07-05 12:18:17')
---
    public function store()
    {
        if (session()->get('role') != 'admin') return redirect()->to('/');

        $tanggal = $this->request->getPost('tanggal');
        $nominal = $this->request->getPost('nominal');

        // Cek apakah tanggal sudah ada
        if ($this->diskonModel->where('tanggal', $tanggal)->first()) {
            return redirect()->back()->with('error', 'Diskon untuk tanggal ini sudah ada!');
        }

        $this->diskonModel->save([
            'tanggal' => $tanggal,
            'nominal' => $nominal,
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `diskon`
WHERE `diskon`.`id` = '14'
DELETE FROM `diskon`
WHERE `id` IN ('14')
---
    public function delete($id)
{
    $diskon = $this->diskonModel->find($id);


    if ($diskon) {
        $this->diskonModel->delete($id);