app/Controllers/Home.php

    public function index(): string
    {
        $product = $this->product->findAll();
---
SELECT *
FROM `product`

    public function profile()
    {
        $username = session()->get('username');
        $data['username'] = $username;

        $buy = $this->transaction->where('username', $username)->findAll();
        $data['buy'] = $buy;

        $product = [];

    if (!empty($buy)) {
        foreach ($buy as $item) {
            $detail = $this->transaction_detail->select('transaction_detail.*, product.nama, product.harga, product.foto')->join('product', 'transaction_detail.product_id=product.id')->where('transaction_id', $item['id'])->findAll();
---
SELECT *
FROM `transaction`
WHERE `username` = 'salwarama'
SELECT `transaction_detail`.*, `product`.`nama`, `product`.`harga`, `product`.`foto`
FROM `transaction_detail`
JOIN `product` ON `transaction_detail`.`product_id`=`product`.`id`
WHERE `transaction_id` = '4'