app/Controllers/TransaksiController.php

INSERT INTO `transaction` (`username`, `total_harga`, `alamat`, `ongkir`, `status`, `created_at`, `updated_at`) VALUES ('salwarama', '10874000', 'Jl. Menoreh ', '25000', 0, '2025-07-05 12:19:07', '2025-07-05 12:19:07')
INSERT INTO `transaction_detail` (`transaction_id`, `product_id`, `jumlah`, `diskon`, `subtotal_harga`, `created_at`, `updated_at`) VALUES (6, '1', 1, '50000', 10849000, '2025-07-05 12:19:07', '2025-07-05 12:19:07')
---
    public function buy()
{
    if ($this->request->getPost()) {
        $dataForm = [
            'username' => $this->request->getPost('username'),
            'total_harga' => $this->request->getPost('total_harga'),
            'alamat' => $this->request->getPost('alamat'),
            'ongkir' => $this->request->getPost('ongkir'),
            'status' => 0,
            'created_at' => date("Y-m-d H:i:s"),
            'updated_at' => date("Y-m-d H:i:s")
        ];

        $this->transaction->insert($dataForm);

        $last_insert_id = $this->transaction->getInsertID();

        foreach ($this->cart->contents() as $value) {
            $dataFormDetail = [
                'transaction_id' => $last_insert_id,
                'product_id' => $value['id'],
                'jumlah' => $value['qty'],
                'diskon' => $value['options']['diskon'] ?? 0,
                'subtotal_harga' => $value['qty'] * $value['price'],
                'created_at' => date("Y-m-d H:i:s"),
                'updated_at' => date("Y-m-d H:i:s")
            ];
            $this->transaction_detail->insert($dataFormDetail);